_posts/2016-08-25-r-pranks.html
---
date: 2016-08-25
tags: 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- dummy-tags-should-be-replaced
author: 
layout: post
title: R pranks
excerpt: I show how you can pull pranks with some subtle alterations to their R environment.
categories: 
- R
- humor
featured: true
---
<p>
One of the more fun features of R is that you can redefine pretty much
anything. While this isn't particularly useful in itself, it can give
you plenty of opportunities to mess with your friends' R sessions.
Well, at least they were your friends before this post.
</p>

<div id="outline-container-org19f1258" class="outline-2">
<h2 id="org19f1258">Mild pranks</h2>
<div class="outline-text-2" id="text-org19f1258">
</div>
<div id="outline-container-org7108f82" class="outline-3">
<h3 id="org7108f82">You can't handle the truth</h3>
<div class="outline-text-3" id="text-org7108f82">
<p>
Starting off, we have the obvious. If you're tripped up by this one
you deserve what's coming to you.
</p>

<div class="org-src-container">
<pre class="src src-R">T <span style="color: #96CBFE;">&lt;-</span> <span style="color: #afd8af;">FALSE</span>
F <span style="color: #96CBFE;">&lt;-</span> <span style="color: #afd8af;">TRUE</span>
</pre>
</div>

<p>
Some people will inflict this upon themselves if they name a
variable T (and set it equal to 0) or F (and set it equal to a
non-zero number).
</p>
</div>
</div>

<div id="outline-container-org5ee3be7" class="outline-3">
<h3 id="org5ee3be7">HAL 9000</h3>
<div class="outline-text-3" id="text-org5ee3be7">
<p>
A similar bush league trick.
</p>

<div class="org-src-container">
<pre class="src src-R">q <span style="color: #96CBFE;">&lt;-</span> <span style="color: #ff1493;">quit</span> <span style="color: #96CBFE;">&lt;-</span> <span style="color: #4c83ff;">function</span>(...) {
    print(paste0(<span style="color: #61CE3C;">"I'm sorry "</span>, Sys.info()[7], <span style="color: #61CE3C;">", I'm afraid I can't do that"</span>))
}
</pre>
</div>

<p>
Bonus points for setting the function up to play the audio clip.
That however needs a little preparation.
</p>
</div>
</div>
<div id="outline-container-org2711811" class="outline-3">
<h3 id="org2711811">No R for you!</h3>
<div class="outline-text-3" id="text-org2711811">
<p>
This one has to be placed in the .Rprofile to work.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #ff1493;">.First</span> <span style="color: #96CBFE;">&lt;-</span> <span style="color: #4c83ff;">function</span>() {
    quit(save = <span style="color: #61CE3C;">"no"</span>, runLast = <span style="color: #afd8af;">FALSE</span>)
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc7ff288" class="outline-2">
<h2 id="orgc7ff288">A bit more devious</h2>
<div class="outline-text-2" id="text-orgc7ff288">
<p>
Now we get into some more insidious tricks.
</p>
</div>
<div id="outline-container-org5b3ea83" class="outline-3">
<h3 id="org5b3ea83">How do we know that two and two make four?</h3>
<div class="outline-text-3" id="text-org5b3ea83">
<p>
This one could presumably go undetected for a while; so perhaps you
might want to make the issue a bit more obvious if you actually run
this one.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #ff1493;">`+`</span> <span style="color: #96CBFE;">&lt;-</span> <span style="color: #4c83ff;">function</span>(xx, yy) {
    sum <span style="color: #96CBFE;">&lt;-</span> .Primitive(<span style="color: #61CE3C;">'+'</span>)(xx, yy)

    <span style="color: #4c83ff;">return</span>(.Primitive(<span style="color: #61CE3C;">'+'</span>)(sum, sum * .Machine$double.eps))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9aba25e" class="outline-3">
<h3 id="org9aba25e"><a href="https://xkcd.com/221/">getRandomNumber</a></h3>
<div class="outline-text-3" id="text-org9aba25e">
<p>
This one might not catch people at all. It is great for
reproducibility though.
</p>

<div class="org-src-container">
<pre class="src src-R">old_set.seed <span style="color: #96CBFE;">&lt;-</span> set.seed
<span style="color: #ff1493;">set.seed</span> <span style="color: #96CBFE;">&lt;-</span> <span style="color: #4c83ff;">function</span>(seed, ...) {
    old_set.seed(42, ...)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd97f4a0" class="outline-3">
<h3 id="orgd97f4a0">Patience is a virtue</h3>
<div class="outline-text-3" id="text-orgd97f4a0">
<p>
Is your friend always talking about how the *apply functions are so
much faster and more elegant? This should put a stop to that.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #ff1493;">make_apply</span> <span style="color: #96CBFE;">&lt;-</span> <span style="color: #4c83ff;">function</span>() {
    timeout <span style="color: #96CBFE;">&lt;-</span> 0
    <span style="color: #4c83ff;">return</span>(<span style="color: #4c83ff;">function</span>(...) {
        Sys.sleep(timeout)
        timeout <span style="color: #96CBFE;">&lt;&lt;-</span> timeout + 1
        base::apply(...)
    })
}

apply <span style="color: #96CBFE;">&lt;-</span> make_apply()
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e41555" class="outline-3">
<h3 id="org8e41555">What we have here is failure to communicate</h3>
<div class="outline-text-3" id="text-org8e41555">
<p>
These don't even need to be pranks. You can change some things to
make them better coders. For instance, you can unilaterally enforce
your own style guide. For their own good.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #ff1493;">'='</span> <span style="color: #96CBFE;">&lt;-</span> <span style="color: #4c83ff;">function</span>(...) {
    <span style="color: #4c83ff;">stop</span>(<span style="color: #61CE3C;">"Using = for assignment violates the style guide; use &lt;- instead"</span>)
}
</pre>
</div>

<p>
Of course, nobody did this for package writers, so hopefully they
don't need to use too many non-conforming packages.
</p>

<p>
It could be worse; I had wanted to do the following
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #ff1493;">'&lt;-'</span> <span style="color: #96CBFE;">&lt;-</span> <span style="color: #4c83ff;">function</span>(...) {
    <span style="color: #4c83ff;">stop</span>(<span style="color: #61CE3C;">"Using &lt;- for assignment violates the style guide; use -&gt; instead"</span>)
}
</pre>
</div>

<p>
Unfortunately, this little gem doesn't work since '-&gt;' is just a
syntactic variation and I can't figure out how to distinguish it
from within the function call. I'll be very appreciative if someone
could show me how to do this.
</p>
</div>
</div>
</div>
